create_clock -period 40.000 -name rclk -waveform {0.000 20.000} [get_ports rclk]
create_clock -period 20.000 -name wclk -waveform {0.000 10.000} [get_ports wclk]
set_input_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports {wdata[*]}]
set_input_delay -clock [get_clocks wclk] -max -add_delay 0.200 [get_ports {wdata[*]}]
set_input_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports rinc]
set_input_delay -clock [get_clocks rclk] -max -add_delay 0.200 [get_ports rinc]
set_input_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports rrst]
set_input_delay -clock [get_clocks rclk] -max -add_delay 0.200 [get_ports rrst]
set_input_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports winc]
set_input_delay -clock [get_clocks wclk] -max -add_delay 0.200 [get_ports winc]
set_input_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports wrst]
set_input_delay -clock [get_clocks wclk] -max -add_delay 0.200 [get_ports wrst]
set_output_delay -clock [get_clocks rclk] -min -add_delay -0.100 [get_ports {rdata[*]}]
set_output_delay -clock [get_clocks rclk] -max -add_delay 0.200 [get_ports {rdata[*]}]
set_output_delay -clock [get_clocks rclk] -min -add_delay -0.100 [get_ports rempty]
set_output_delay -clock [get_clocks rclk] -max -add_delay 0.200 [get_ports rempty]
set_output_delay -clock [get_clocks wclk] -min -add_delay -0.100 [get_ports wfull]
set_output_delay -clock [get_clocks wclk] -max -add_delay 0.200 [get_ports wfull]
set_clock_groups -asynchronous -group [get_clocks wclk] -group [get_clocks rclk]
set_clock_groups -asynchronous -group [get_clocks rclk] -group [get_clocks wclk]

set_false_path -from [get_clocks rclk] -to [get_clocks rclk]
set_false_path -from [get_clocks wclk] -to [get_clocks wclk]
